cfd-simulation/mackerel/U_0p4/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

application simpleFoam;

startFrom startTime;
startTime 0;
stopAt endTime;
endTime 1000;

deltaT 1;
writeControl timeStep;
writeInterval 100;
purgeWrite 0;
writeFormat ascii;
writePrecision 6;
writeCompression off;
timeFormat general;
timePrecision 6;
runTimeModifiable true;

functions
{
    forcesFish
    {
        type            forces;
        libs            ("libforces.so");
        patches         (fish);
        rho             rhoInf;
        rhoInf          1000;
        CofR            (0 0 0);
    }
}
